<?php
    class guestController extends Controller{
        
        #======================================================================#
        #index() 首頁引導方法                                                  #
        #======================================================================#
        
        public function index(){
            $this->view("index");
        }
        #======================================================================#
        #reception() 前台引導方法                                              #
        #======================================================================#
        
        public function reception(){
            header("location:/challenge2/reception");
        }
        #======================================================================#
        #backstage() 後台引導方法                                              #
        #======================================================================#
        
        public function backstage(){
            header("location:/challenge2/backstage");
        }
        
        
    }
?>